// Кабинет 115 (корпус 1, 1 эт.) — обществоведение. 3 ряда по 5 парт, учительский стол, доска.
// Легенда тайлов — src/gen/tiles.js (TILE_DEFS). Координаты — в тайлах.
export const CAB_115 = {
  id: 'cab_115',
  name: 'Каб. 115',
  floor: '.',
  music: 'lesson',
  building: 1,
  floorNo: 1,
  rows: [
    '##############################',
    '#WwWNWwWWWwWBBBBBBwWWWNWWWDWW#',
    '#............................#',
    '#.............YY.............#',
    '#.......TT....TT....TT.......#',
    '#............................#',
    '#.......TT....TT....TT.......#',
    '#............................#',
    '#.......TT....TT....TT.......#',
    '#............................#',
    '#.......TT....TT....TT.......#',
    '#............................#',
    '#.......TT....TT....TT.......#',
    '#.KK.......................P.#',
    '##############################',
  ],
  spawns: {
    door: {x:26,y:2,dir:"down"},
    teacher: {x:15,y:2,dir:"down"},
  },
  exits: [
    { x: 26, y: 1, to: "k1_f1", spawn: "door115" },
  ],
  objects: [
  ],
  npcs: [
  ],
};
