// Кабинет 312 (корпус 2, 3 эт.) — белорусский язык. 3 ряда по 5 парт, учительский стол, доска.
// Легенда тайлов — src/gen/tiles.js (TILE_DEFS). Координаты — в тайлах.
export const CAB_312 = {
  id: 'cab_312',
  name: 'Каб. 312',
  floor: '.',
  music: 'lesson',
  building: 2,
  floorNo: 3,
  rows: [
    '##############################',
    '#WwWWWwWWWwWBBBBBBwWWWNWWWDWW#',
    '#.P........................P.#',
    '#.............YY.............#',
    '#.......TT....TT....TT.......#',
    '#............................#',
    '#.......TT....TT....TT.......#',
    '#............................#',
    '#.......TT....TT....TT.......#',
    '#............................#',
    '#.......TT....TT....TT.......#',
    '#............................#',
    '#.......TT....TT....TT.......#',
    '#.P..........................#',
    '##############################',
  ],
  spawns: {
    door: {x:26,y:2,dir:"down"},
    teacher: {x:15,y:2,dir:"down"},
  },
  exits: [
    { x: 26, y: 1, to: "k2_f3", spawn: "door312" },
  ],
  objects: [
  ],
  npcs: [
  ],
};
