// Кабинет 305 (корпус 1, 3 эт.) — математика. 3 ряда по 5 парт, учительский стол, доска.
// Легенда тайлов — src/gen/tiles.js (TILE_DEFS). Координаты — в тайлах.
export const CAB_305 = {
  id: 'cab_305',
  name: 'Каб. 305',
  floor: '.',
  music: 'lesson',
  building: 1,
  floorNo: 3,
  rows: [
    '##############################',
    '#WwWNWwWWWwWBBBBBBwWWWNWWWDWW#',
    '#.P..........................#',
    '#.............YY.............#',
    '#.......TT....TT....TT.......#',
    '#............................#',
    '#.......TT....TT....TT.......#',
    '#............................#',
    '#.......TT....TT....TT.......#',
    '#............................#',
    '#.......TT....TT....TT.......#',
    '#............................#',
    '#.......TT....TT....TT.......#',
    '#.KK.........................#',
    '##############################',
  ],
  spawns: {
    door: {x:26,y:2,dir:"down"},
    teacher: {x:15,y:2,dir:"down"},
  },
  exits: [
    { x: 26, y: 1, to: "k1_f3", spawn: "door305" },
  ],
  objects: [
  ],
  npcs: [
  ],
};
