// Кабинет 208 (корпус 2, 2 эт.) — русский язык. 3 ряда по 5 парт, учительский стол, доска.
// Легенда тайлов — src/gen/tiles.js (TILE_DEFS). Координаты — в тайлах.
export const CAB_208 = {
  id: 'cab_208',
  name: 'Каб. 208',
  floor: '.',
  music: 'lesson',
  building: 2,
  floorNo: 2,
  rows: [
    '##############################',
    '#WwWWWNWWWNWBBBBBBwWNWwWWWDWW#',
    '#............................#',
    '#.............YY.............#',
    '#.......TT....TT....TT.......#',
    '#............................#',
    '#.......TT....TT....TT.......#',
    '#............................#',
    '#.......TT....TT....TT.......#',
    '#............................#',
    '#.......TT....TT....TT.......#',
    '#............................#',
    '#.......TT....TT....TT.......#',
    '#.K........................P.#',
    '##############################',
  ],
  spawns: {
    door: {x:26,y:2,dir:"down"},
    teacher: {x:15,y:2,dir:"down"},
  },
  exits: [
    { x: 26, y: 1, to: "k2_f2", spawn: "door208" },
  ],
  objects: [
  ],
  npcs: [
  ],
};
