// Кабинет 214 (корпус 1, 2 эт.) — физика. 3 ряда по 5 парт, учительский стол, доска.
// Легенда тайлов — src/gen/tiles.js (TILE_DEFS). Координаты — в тайлах.
export const CAB_214 = {
  id: 'cab_214',
  name: 'Каб. 214',
  floor: '.',
  music: 'lesson',
  building: 1,
  floorNo: 2,
  rows: [
    '##############################',
    '#WwWWWwWWWwWBBBBBBwWWWNWWWDWW#',
    '#..........................K.#',
    '#.............YY...........K.#',
    '#.......TT....TT....TT.......#',
    '#............................#',
    '#.......TT....TT....TT.......#',
    '#............................#',
    '#.......TT....TT....TT.......#',
    '#............................#',
    '#.......TT....TT....TT.......#',
    '#............................#',
    '#.......TT....TT....TT.......#',
    '#.KKK........................#',
    '##############################',
  ],
  spawns: {
    door: {x:26,y:2,dir:"down"},
    teacher: {x:15,y:2,dir:"down"},
  },
  exits: [
    { x: 26, y: 1, to: "k1_f2", spawn: "door214" },
  ],
  objects: [
  ],
  npcs: [
  ],
};
